{
    "cricket_rules": "Cricket is a bat-and-ball game played between two teams of eleven players. The match is officiated by two umpires on the field, with a third umpire and match referee in official games. One team bats to score runs while the other bowls and fields to restrict scoring and dismiss batters. Each team takes turns batting and bowling. The core rules include how a player can be out (e.g., bowled, caught, run out, LBW), how runs are scored (by running or hitting boundaries), and the structure of overs. The game format (Test, ODI, T20) determines the number of overs and innings. Fielding restrictions, powerplays, and the Decision Review System (DRS) are also part of modern rules.",
    "cricket_scoring": "Cricket scoring is primarily based on runs. A batsman scores runs by hitting the ball and running between the wickets, or by hitting the ball to the boundary (4 runs) or over the boundary without bouncing (6 runs). Extra runs can be awarded for wides, no-balls, byes, and leg byes. A team's total score is the sum of all individual runs plus extras. In limited-overs formats, scoring quickly is crucial, and strike rate becomes an important metric. Statistics like batting average, economy rate, and partnership runs also play a role in performance analysis.",
    "cricket_players": "Cricket players are usually specialized as batsmen, bowlers, all-rounders, or wicketkeepers. Legendary players like Sachin Tendulkar, Don Bradman, and Muttiah Muralitharan have shaped cricket history. Current stars include Virat Kohli, Babar Azam, Steve Smith, and Rashid Khan. Players are judged based on their performances across different formats—Test, ODI, and T20. Fitness, consistency, adaptability, and technique are key traits of top players. Many players become national icons and ambassadors of the game through their achievements and conduct both on and off the field.",
    "cricket_equipment": "Cricket requires several types of equipment. Bats are usually made of willow wood and vary in size. Balls are hard, cork-based and covered with leather, and differ slightly in color and durability depending on the format. Players wear protective gear such as pads, gloves, helmets, abdominal guards, and sometimes arm guards. Fielders, especially in close positions, may wear protective eyewear and inner gloves. The pitch is maintained with great care and is a critical element in the game. Other equipment includes wickets (stumps and bails), boundary ropes, and player kits.",
    "cricket_formats": "Cricket is played in multiple formats, each with its unique style and duration. Test matches are the longest format, played over five days with two innings per side, testing endurance and technique. One Day Internationals (ODIs) consist of 50 overs per side and require a balanced approach between aggression and patience. T20 (Twenty20) matches are the shortest format, with each team playing 20 overs, favoring high-impact performances and rapid gameplay. Franchise leagues like the IPL and BBL have popularized T20 cricket globally. Each format has specialized strategies, selection criteria, and fanbases.",
    "cricket_history": "Cricket dates back to the 16th century in England, evolving from rural games to an organized sport. It became widely popular during the British colonial period, spreading to countries like India, Australia, and the Caribbean. The first international match took place in 1844, and Test cricket began in 1877. Iconic moments include India’s 1983 and 2011 World Cup wins, Australia's long-standing dominance, and the rise of modern T20 leagues. The game has grown to include women's cricket, technological innovations, and global governance by the International Cricket Council (ICC).",
    "cricket_terms": "Cricket has a rich vocabulary of terms that describe its unique gameplay. 'LBW' stands for Leg Before Wicket and refers to a mode of dismissal. A 'duck' is when a batsman gets out without scoring. 'Yorker' is a delivery aimed at the batsman’s feet, often used in death overs. A 'maiden over' is one in which no runs are conceded. 'Powerplay' limits the number of fielders outside the circle. A 'googly' is a deceptive delivery by a leg-spinner. 'Hat-trick' means taking three wickets in three consecutive deliveries. 'Nightwatchman' is a lower-order batter sent in to protect a top-order batter before the day's end.",
    "football_rules": "Football, or soccer, is played between two teams of eleven players each, including a goalkeeper. The match lasts 90 minutes, divided into two halves of 45 minutes. The goal is to score more goals than the opponent by getting the ball into the opposing net. Basic rules include no use of hands (except by the goalkeeper), offside regulations, free kicks, penalties, and various types of fouls. Referees enforce the rules and can give yellow or red cards for misconduct. The team with the most goals at the end wins; ties may lead to extra time or penalties in knockout formats.",
    "football_scoring": "Scoring in football occurs when the ball fully crosses the opponent's goal line between the posts and under the crossbar. Each goal counts as one point. Goals can be scored through open play, set-pieces, or penalties. Own goals count for the opposing team. In league matches, a win usually grants 3 points, a draw 1 point, and a loss 0 points. In knockout stages, if the score is tied, matches may go into extra time and potentially penalty shootouts. Goal difference and head-to-head results are often used as tiebreakers in tournaments and leagues.",
    "football_players": "Football players specialize in various positions such as forwards, midfielders, defenders, and goalkeepers. Legendary players include Pelé, Diego Maradona, Lionel Messi, and Cristiano Ronaldo. Modern training involves technical, tactical, and physical conditioning. Players are scouted from youth academies or through national competitions. Each role has specific responsibilities: goalkeepers protect the net, defenders stop attacks, midfielders link play, and forwards score goals. Team chemistry, discipline, and adaptability are key traits of successful footballers.",
    "football_equipment": "Essential football equipment includes a ball, cleats, shin guards, socks, shorts, and a jersey. Goalkeepers wear gloves and often have specialized gear. The ball must meet size and weight regulations depending on the age group. Shin guards are mandatory for protection. Jerseys are made of moisture-wicking synthetic materials and display team logos and player numbers. Advanced technologies like GPS trackers and heart-rate monitors are now common in elite training. Stadiums use high-quality turf and goal-line technology to support gameplay.",
    "football_tournaments": "Major football tournaments include the FIFA World Cup, UEFA Champions League, Copa America, UEFA Euro, and the African Cup of Nations. The World Cup, held every four years, is the most prestigious international competition. Champions League features top European clubs and is watched globally. National teams compete in qualification rounds to earn a spot in these events. These tournaments have rich traditions, fierce rivalries, and showcase the highest level of football talent, often determining legacies of players and teams.",
    "football_history": "Football's origins trace back to ancient games in China and medieval Europe, but modern association football began in England in the 19th century with standardized rules. The Football Association was formed in 1863. The first international match was between England and Scotland in 1872. The FIFA World Cup began in 1930, and club competitions grew over the 20th century. Women's football has seen rapid growth since the 1990s. Today, football is the world’s most popular sport, followed by billions and played in almost every country.",
    "football_training": "Football training is a multifaceted program that includes endurance, strength, speed, agility, and tactical awareness. Players typically train 5–6 days a week, with sessions tailored to positions—goalkeepers focus on reflexes and diving, while midfielders may work more on stamina and ball distribution. Training begins with a warm-up and stretching, followed by skill drills such as passing, dribbling, and shooting. Tactical training involves game simulations and strategy. Nutrition and rest are integral parts of training, with personalized meal plans and recovery routines. Pre-season training focuses on building fitness, while in-season training emphasizes match readiness and injury prevention. Youth academies often mirror this structure to prepare players for professional levels."
}